FACT_TOPICS = [
    "космос",
    "тварини",
    "людське тіло",
    "історія",
    "техніка та винаходи",
    "мови та слова",
    "їжа",
    "океани",
    "рослини",
    "спорт",
    "мистецтво",
    "фізика",
]


QUIZ_TOPICS = {
    "geo": "Географія",
    "history": "Історія",
    "science": "Наука",
    "movies": "Кіно",
}

GYM = {
    "full_body": "Все тіло",
    "split": "Спліт",
    "lover_upper": "Верх-низ",
    "push_pull": "Тягни-штовхай",
}

DAYS = {
    "1": "1 день",
    "2": "2 дні",
    "3": "3 дні",
    "4": "4 дні",
    "5": "5 днів",
    "6": "6 днів",
    "7": "7 днів",
}

EQUIPMENT = {
    "gym": "зал",
    "dumbbells": "гантелі",
    "body weight": "без обладнання",
}

RECOMMEND_CATEGORIES = {
    "movies": "Фільми",
    "books": "Книги",
    "music": "Музика",
    "sport": "Спорт",
    "food": "Їжа"
}

FALLBACK = "Не вдалося звʼязатися з ChatGPT. Спробуй ще раз за хвилину."
